[IgnoreSlotWeight X2AbilityTemplate]
LocFriendlyName="Equipment Handling"
LocLongDescription="A weighted item that is in the primary, secondary, ammo, auxiliary, grenade, or vest slot will have its innate weight reduced by 1. This will not affect mobility penalties from other sources such as attachments."
LocHelpText="A weighted item that is in the primary, secondary, ammo, auxiliary, grenade, or vest slot will have its innate weight reduced by 1. This will not affect mobility penalties from other sources such as attachments."